---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnEdge
source: html/07babda3-b779-084b-c233-38719d63b791.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.EndsNotOnEdge Property

Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.

## Syntax (C#)
```csharp
public static FailureDefinitionId EndsNotOnEdge { get; }
```